paparazzi/paparazzi/sw/airborne/arch/stm32/mcu_periph/i2c_arch.c
/*
 * Copyright (C) 2009-2012 The Paparazzi Team
 *
 * This file is part of paparazzi.
 *
 * paparazzi is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 2, or (at your option)
 * any later version.
 *
 * paparazzi is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with paparazzi; see the file COPYING.  If not, write to
 * the Free Software Foundation, 59 Temple Place - Suite 330,
 * Boston, MA 02111-1307, USA.
 *
 */

/**
 * @file arch/stm32/mcu_periph/i2c_arch.c
 * @ingroup stm32_arch
 * Handling of I2C hardware for STM32.
 */

#include "mcu_periph/i2c.h"

#include BOARD_CONFIG

#include <libopencm3/stm32/rcc.h>
#include <libopencm3/stm32/gpio.h>
#include <libopencm3/cm3/nvic.h>
#include <libopencm3/cm3/scb.h>

#include "mcu_periph/gpio.h"


#ifdef I2C_DEBUG_LED
#include "i2c_debug_led.h"
#endif // I2C_DEBUG_LED

//////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////


// Error bit mask
// XXX: consider moving this define into libopencm3
#if !defined(STM32F3)
#define I2C_SR1_ERR_MASK (I2C_SR1_SMBALERT | \
                          I2C_SR1_TIMEOUT |  \
                          I2C_SR1_PECERR |   \
                          I2C_SR1_OVR |      \
                          I2C_SR1_AF |       \
                          I2C_SR1_ARLO |     \
                          I2C_SR1_BERR)
#else
#define I2C_ISR_ERR_MASK (I2C_ISR_ALERT | \
			  I2C_ISR_TIMEOUT |	\
			  I2C_ISR_PECERR |	\
			  I2C_ISR_OVR |		\
			  I2C_ISR_NACKF |	\
			  I2C_ISR_ARLO |	\
			  I2C_ISR_BERR)
#endif

// Bit Control

#define BIT_X_IS_SET_IN_REG(X,REG)	(((REG) & (X)) == (X))

// disable and enable irq functions are not implemented in libopencm3 defining them here
// XXX: consider moving this definitions into libopencm3
static inline void __disable_irq(void)  { asm volatile ("cpsid i"); }
static inline void __enable_irq(void)   { asm volatile ("cpsie i"); }

// Critical Zones

#define __I2C_REG_CRITICAL_ZONE_START	__disable_irq();
#define __I2C_REG_CRITICAL_ZONE_STOP	__enable_irq();


static inline void PPRZ_I2C_SEND_STOP(uint32_t i2c)
{
  // Man: p722:  Stop generation after the current byte transfer or after the current Start condition is sent.
#if !defined(STM32F3)
  I2C_CR1(i2c) |= I2C_CR1_STOP;
#else
  I2C_CR2(i2c) |= I2C_CR2_STOP;
#endif

#ifdef I2C_DEBUG_LED
  LED2_ON();
  LED1_ON();
  LED1_OFF();
  LED2_OFF();
#endif
}

// (RE)START

static inline void PPRZ_I2C_SEND_START(struct i2c_periph *periph)
{
  uint32_t i2c = (uint32_t) periph->reg_addr;

  // Reset the buffer pointer to the first byte
  periph->idx_buf = 0;

#ifdef I2C_DEBUG_LED
  LED_SHOW_ACTIVE_BITS(regs);

  LED2_ON();
  LED1_ON();
  LED1_OFF();
  LED1_ON();
  LED1_OFF();
  LED1_ON();
  LED1_OFF();
  LED2_OFF();
#endif

  // Enable Error IRQ, Event IRQ but disable Buffer IRQ
#if !defined(STM32F3)
  I2C_CR2(i2c) |= I2C_CR2_ITERREN;
  I2C_CR2(i2c) |= I2C_CR2_ITEVTEN;
  I2C_CR2(i2c) &= ~ I2C_CR2_ITBUFEN;

  // Issue a new start
  I2C_CR1(i2c) =  (I2C_CR1_START | I2C_CR1_PE);
  periph->status = I2CStartRequested;

#else
  I2C_CR1(i2c) |= I2C_CR1_ERRIE;
  I2C_CR1(i2c) |= I2C_CR1_TXIE;
  I2C_CR1(i2c) |= I2C_CR1_RXIE;
  //I2C_CR1(i2c) |= I2C_CR1_TCIE;
  //I2C_CR1(i2c) |= I2C_CR1_NACKIE; //check!!! seems fine
  //Program slave address
  i2c_set_7bit_address(i2c, periph->trans[periph->trans_extract_idx]->slave_addr);
  //Program direction and program number of bytes to transfer
  if (periph->trans[periph->trans_extract_idx]->type == I2CTransRx)
    {
    i2c_set_read_transfer_dir(i2c);
    i2c_set_bytes_to_transfer(i2c, periph->trans[periph->trans_extract_idx]->len_r);
    }
  else
    {
      i2c_set_write_transfer_dir(i2c); //check for TXRX seems fine
      i2c_set_bytes_to_transfer(i2c, periph->trans[periph->trans_extract_idx]->len_w); //check for TXRX seems fine
    }
  //autoend=1
  i2c_enable_autoend(i2c);
  i2c_send_start(i2c);
  periph->status = I2CStartRequested;
#endif
}

// STOP

///////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////
//
//	SUBTRANSACTION SEQUENCES
//	-We arrive here every time a ISR is called with no error

enum STMI2CSubTransactionStatus {
  STMI2C_SubTra_Busy,
  STMI2C_SubTra_Ready_StopRequested,
  STMI2C_SubTra_Ready,
  STMI2C_SubTra_Error
};

// Doc ID 13902 Rev 11 p 710/1072
// Transfer Sequence Diagram for Master Transmitter
static inline enum STMI2CSubTransactionStatus stmi2c_send(uint32_t i2c, struct i2c_periph *periph, struct i2c_transaction *trans)
{
#if !defined(STM32F3)
  uint16_t SR1 = I2C_SR1(i2c);
#else
  uint16_t ISR = I2C_ISR(i2c);
#endif

#if !defined(STM32F3)
  // Start Condition Was Just Generated
  if (BIT_X_IS_SET_IN_REG( I2C_SR1_SB, SR1 ) )
  {
    // Disable buffer interrupt
    I2C_CR2(i2c) &= ~ I2C_CR2_ITBUFEN;
    // Send Slave address and wait for ADDR interrupt
    I2C_DR(i2c) = trans->slave_addr;
    // Document the current Status
    periph->status = I2CAddrWrSent;
  }
  // Address Was Sent
  else if (BIT_X_IS_SET_IN_REG(I2C_SR1_ADDR, SR1) )
  {
    // Now read SR2 to clear the ADDR status Bit
    uint16_t SR2  __attribute__ ((unused)) = I2C_SR2(i2c);

    // Maybe check we are transmitting (did not loose arbitration for instance)
    // if (! BIT_X_IS_SET_IN_REG(I2C_SR2_TRA, SR2)) { }
    // update: this should be caught by the ARLO error: so we will not arrive here

    // Send First max 2 bytes
    I2C_DR(i2c) = trans->buf[0];
    if (trans->len_w > 1)
    {
      I2C_DR(i2c) = trans->buf[1];
      periph->idx_buf = 2;
    }
    else
    {
      periph->idx_buf = 1;
    }

    // Enable buffer-space available interrupt
    // only if there is more to send: wait for TXE, no more to send: wait for BTF
    if ( periph->idx_buf < trans->len_w)
      I2C_CR2(i2c) |= I2C_CR2_ITBUFEN;

    // Document the current Status
    periph->status = I2CSendingByte;
  }
  // The buffer is not full anymore AND we were not waiting for BTF
  else if ((BIT_X_IS_SET_IN_REG(I2C_SR1_TxE, SR1) ) && (BIT_X_IS_SET_IN_REG(I2C_CR2_ITBUFEN, I2C_CR2(i2c)))  )
  {
    // Send the next byte
    I2C_DR(i2c) = trans->buf[periph->idx_buf];
    periph->idx_buf++;

    // All bytes Sent? Then wait for BTF instead
    if ( periph->idx_buf >= trans->len_w)
    {
      // Not interested anymore to know the buffer has space left
      I2C_CR2(i2c) &= ~ I2C_CR2_ITBUFEN;
      // Next interrupt will be BTF (or error)
    }
  }
  // BTF: means last byte was sent
  else if (BIT_X_IS_SET_IN_REG(I2C_SR1_BTF, SR1) )
  {
    if (trans->type == I2CTransTx)
    {
      // Tell the driver we are ready
      trans->status = I2CTransSuccess;
    }
    // Otherwise we still need to do the receiving part

    return STMI2C_SubTra_Ready;
  }
#else
  if (BIT_X_IS_SET_IN_REG(I2C_ISR_TXIS, ISR) )
  {
    // Send the next byte
    I2C_TXDR(i2c) = trans->buf[periph->idx_buf];
    periph->idx_buf++;
    if (periph->idx_buf == (trans->len_w+1))
      {
	if (trans->type == I2CTransTx)
	  {
	    // Tell the driver we are ready
	    trans->status = I2CTransSuccess;
	  }
	// Otherwise we still need to do the receiving part

	return STMI2C_SubTra_Ready;
      }
    // Document the current Status
    periph->status = I2CSendingByte;
  }
#endif
  else // Event Logic Error
  {
    return STMI2C_SubTra_Error;
  }

  return STMI2C_SubTra_Busy;
}

#if !defined(STM32F3)
// Doc ID 13902 Rev 11 p 714/1072
// Transfer Sequence Diagram for Master Receiver for N=1
static inline enum STMI2CSubTransactionStatus stmi2c_read1(uint32_t i2c, struct i2c_periph *periph, struct i2c_transaction *trans)
{
  uint16_t SR1 = I2C_SR1(i2c);

  // Start Condition Was Just Generated
  if (BIT_X_IS_SET_IN_REG( I2C_SR1_SB, SR1 ) )
  {
    I2C_CR2(i2c) &= ~ I2C_CR2_ITBUFEN;
    I2C_DR(i2c) = trans->slave_addr | 0x01;

    // Document the current Status
    periph->status = I2CAddrRdSent;
  }
  // Address Was Sent
  else if (BIT_X_IS_SET_IN_REG(I2C_SR1_ADDR, SR1) )
  {
    // First Clear the ACK bit: after the next byte we do not want new bytes
    I2C_CR1(i2c) &= ~ I2C_CR1_POS;
    I2C_CR1(i2c) &= ~ I2C_CR1_ACK;

