paparazzi/paparazzi/sw/airborne/arch/stm32/mcu_periph/i2c_arch.c
    __I2C_REG_CRITICAL_ZONE_STOP;
    // --- end of critical zone -----------

    // Document the current Status
    periph->status = I2CStopRequested;

    // read the byte2 we had in the buffer (BTF means 2 bytes available)
    trans->buf[periph->idx_buf] = I2C_DR(i2c);
    periph->idx_buf ++;

    // Ask for an interrupt to read the last byte (which is normally still busy now)
    // The last byte will be received with RXNE
    I2C_CR2(i2c) |= I2C_CR2_ITBUFEN;
  }
#endif
  else // Event Logic Error
  {
    return STMI2C_SubTra_Error;
  }

  return STMI2C_SubTra_Busy;
}

////////////////////////////////////////////////
// Restore bus conditions to normal after errors

static inline void i2c_error(struct i2c_periph *periph)
{
#ifdef I2C_DEBUG_LED
  uint8_t err_nr = 0;
#endif
  periph->errors->er_irq_cnt;
#if !defined(STM32F3)
  if ((I2C_SR1((uint32_t)periph->reg_addr) & I2C_SR1_AF) != 0) { /* Acknowledge failure */
#else
  if ((I2C_ISR((uint32_t)periph->reg_addr) & I2C_ISR_NACKF) != 0) { /* Acknowledge failure */
#endif
    periph->errors->ack_fail_cnt++;
#if !defined(STM32F3)
    I2C_SR1((uint32_t)periph->reg_addr) &= ~I2C_SR1_AF;
#else
    I2C_ICR((uint32_t)periph->reg_addr) |= I2C_ICR_NACKCF;
#endif
#ifdef I2C_DEBUG_LED
    err_nr = 1;
#endif
  }
#if !defined(STM32F3)
  if ((I2C_SR1((uint32_t)periph->reg_addr) & I2C_SR1_BERR) != 0) {     /* Misplaced Start or Stop condition */
#else
  if ((I2C_ISR((uint32_t)periph->reg_addr) & I2C_ISR_BERR) != 0) {     /* Misplaced Start or Stop condition */
#endif
    periph->errors->miss_start_stop_cnt++;
#if !defined(STM32F3)
    I2C_SR1((uint32_t)periph->reg_addr) &= ~I2C_SR1_BERR;
#else
    I2C_ICR((uint32_t)periph->reg_addr) |= I2C_ICR_BERRCF;
#endif
#ifdef I2C_DEBUG_LED
    err_nr = 2;
#endif
  }
#if !defined(STM32F3)
  if ((I2C_SR1((uint32_t)periph->reg_addr) & I2C_SR1_ARLO) != 0) {     /* Arbitration lost */
#else
  if ((I2C_ISR((uint32_t)periph->reg_addr) & I2C_ISR_ARLO) != 0) {     /* Arbitration lost */
#endif
    periph->errors->arb_lost_cnt++;
#if !defined(STM32F3)
    I2C_SR1((uint32_t)periph->reg_addr) &= ~I2C_SR1_ARLO;
#else
    I2C_ICR((uint32_t)periph->reg_addr) |= I2C_ICR_ARLOCF;
#endif
#ifdef I2C_DEBUG_LED
    err_nr = 3;
#endif
  }
#if !defined(STM32F3)
  if ((I2C_SR1((uint32_t)periph->reg_addr) & I2C_SR1_OVR) != 0) {      /* Overrun/Underrun */
#else
  if ((I2C_ISR((uint32_t)periph->reg_addr) & I2C_ISR_OVR) != 0) {      /* Overrun/Underrun */
#endif
    periph->errors->over_under_cnt++;
#if !defined(STM32F3)
    I2C_SR1((uint32_t)periph->reg_addr) &= ~I2C_SR1_OVR;
#else
    I2C_ICR((uint32_t)periph->reg_addr) |= I2C_ICR_OVRCF;
#endif
#ifdef I2C_DEBUG_LED
    err_nr = 4;
#endif
  }
#if !defined(STM32F3)
  if ((I2C_SR1((uint32_t)periph->reg_addr) & I2C_SR1_PECERR) != 0) {   /* PEC Error in reception */
#else
  if ((I2C_ISR((uint32_t)periph->reg_addr) & I2C_ISR_PECERR) != 0) {   /* PEC Error in reception */
#endif
    periph->errors->pec_recep_cnt++;
#if !defined(STM32F3)
    I2C_SR1((uint32_t)periph->reg_addr) &= ~I2C_SR1_PECERR;
#else
    I2C_ICR((uint32_t)periph->reg_addr) |= I2C_ICR_PECCF;
#endif
#ifdef I2C_DEBUG_LED
    err_nr = 5;
#endif
  }
#if !defined(STM32F3)
  if ((I2C_SR1((uint32_t)periph->reg_addr) & I2C_SR1_TIMEOUT) != 0) {  /* Timeout or Tlow error */
#else
  if ((I2C_ISR((uint32_t)periph->reg_addr) & I2C_ISR_TIMEOUT) != 0) {  /* Timeout or Tlow error */
#endif
    periph->errors->timeout_tlow_cnt++;
#if !defined(STM32F3)
    I2C_SR1((uint32_t)periph->reg_addr) &= ~I2C_SR1_TIMEOUT;
#else
    I2C_ICR((uint32_t)periph->reg_addr) |= I2C_ICR_TIMOUTCF;
#endif
#ifdef I2C_DEBUG_LED
    err_nr = 6;
#endif
  }
#if !defined(STM32F3)
  if ((I2C_SR1((uint32_t)periph->reg_addr) & I2C_SR1_SMBALERT) != 0) { /* SMBus alert */
#else
  if ((I2C_ISR((uint32_t)periph->reg_addr) & I2C_ISR_ALERT) != 0) { /* SMBus alert */
#endif
    periph->errors->smbus_alert_cnt++;
#if !defined(STM32F3)
    I2C_SR1((uint32_t)periph->reg_addr) &= ~I2C_SR1_SMBALERT;
#else
    I2C_ICR((uint32_t)periph->reg_addr) |= I2C_ICR_ALERTCF;
#endif
#ifdef I2C_DEBUG_LED
    err_nr = 7;
#endif
  }

#ifdef I2C_DEBUG_LED
  LED_ERROR(20, err_nr);
#endif

  return;
}


static inline void stmi2c_clear_pending_interrupts(uint32_t i2c)
{
#if !defined(STM32F3)
  uint16_t SR1 = I2C_SR1(i2c);
#else
  uint16_t ISR = I2C_ISR(i2c);
#endif

  // Certainly do not wait for buffer interrupts:
  // -------------------------------------------
#if !defined(STM32F3)
  I2C_CR2(i2c) &= ~ I2C_CR2_ITBUFEN;			// Disable TXE, RXNE
#endif

  // Error interrupts are handled separately:
  // ---------------------------------------

  // Clear Event interrupt conditions:
  // --------------------------------

#if !defined(STM32F3)
  // Start Condition Was Generated
  if (BIT_X_IS_SET_IN_REG( I2C_SR1_SB, SR1 ) )
  {
    // SB: cleared by software when reading SR1 and writing to DR
    I2C_DR(i2c) = 0x00;
  }
  // Address Was Sent
  if (BIT_X_IS_SET_IN_REG(I2C_SR1_ADDR, SR1) )
  {
    // ADDR: Cleared by software when reading SR1 and then SR2
    uint16_t SR2 __attribute__ ((unused)) = I2C_SR2(i2c);
  }
  // Byte Transfer Finished
  if (BIT_X_IS_SET_IN_REG(I2C_SR1_BTF, SR1) )
  {
    // SB: cleared by software when reading SR1 and reading/writing to DR
    uint8_t dummy __attribute__ ((unused)) = I2C_DR(i2c);
    I2C_DR(i2c) = 0x00;
  }
#else
  // TXIS: TXDR is empty and need to be written
  if (BIT_X_IS_SET_IN_REG( I2C_ISR_TXIS, ISR ) )
  {
    // TXIS: cleared by software by writing to TXDR
    I2C_TXDR(i2c) = 0x00;
  }
  // RXNE: RXDR is not empty and needs to be read
  if (BIT_X_IS_SET_IN_REG( I2C_ISR_RXNE, ISR ) )
  {
    // RXNE: cleared by software by reading from RXDR
    uint16_t dummy __attribute__ ((unused)) = I2C_RXDR(i2c);
  }
  // TC: Transfer complete, Reload=0, autoend=0 and nbytes have been transfered
  if (BIT_X_IS_SET_IN_REG( I2C_ISR_TC, ISR ) )
  {
    // TC: cleared by software by sending a STOP or START
    i2c_send_stop(i2c);
  }
#endif

}


////////////////////////////////////////////////
// Restore bus conditions to normal after errors

static inline void i2c_irq(struct i2c_periph *periph)
{

