paparazzi/paparazzi/sw/airborne/arch/stm32/mcu_periph/i2c_arch.c
      // Error
#ifdef I2C_DEBUG_LED
      LED2_ON();
      LED1_ON();
      LED2_OFF();
      LED1_OFF();

      LED_SHOW_ACTIVE_BITS(regs);
#endif

      // Clear Running Events
      stmi2c_clear_pending_interrupts(i2c);
    }

    // RxTx -> Restart and do Rx part
    if (trans->type == I2CTransTxRx)
    {
      trans->type = I2CTransRx;
      periph->status = I2CStartRequested;
#if !defined(STM32F3)
      I2C_CR1(i2c) |= I2C_CR1_START;

      // Silent any BTF that would occur before SB
      I2C_DR(i2c) = 0x00;
#else
      I2C_CR2(i2c) |= I2C_CR2_START;
#endif
    }
    // If a restart is not needed: Rx part or Tx-only
    else
    {
#if !defined(STM32F3)
      // Ready, no stop condition set yet
      if (ret == STMI2C_SubTra_Ready)
      {

        // Program a stop
        PPRZ_I2C_SEND_STOP(i2c);

        // Silent any BTF that would occur before STOP is executed
        I2C_DR(i2c) = 0x00;
      }
#endif
      // Jump to the next transaction
      periph->trans_extract_idx++;
      if (periph->trans_extract_idx >= I2C_TRANSACTION_QUEUE_LEN)
        periph->trans_extract_idx = 0;

      // Tell everyone we are ready
      periph->status = I2CIdle;


      // if we have no more transaction to process, stop here
      if (periph->trans_extract_idx == periph->trans_insert_idx)
      {

#ifdef I2C_DEBUG_LED
        LED2_ON();
        LED1_ON();
        LED1_OFF();
        LED1_ON();
        LED1_OFF();
        LED2_OFF();
#endif
      }
      // if not, start next transaction
      else
      {
        // Restart transaction doing the Rx part now
        // --- moved to idle function
        PPRZ_I2C_SEND_START(periph);
        // ------
      }
    }
  }

  return;
}


/*
// Make sure the bus is free before resetting (p722)
if (regs->SR2 & (I2C_FLAG_BUSY >> 16)) {
// Reset the I2C block
I2C_SoftwareResetCmd(periph->reg_addr, ENABLE);
I2C_SoftwareResetCmd(periph->reg_addr, DISABLE);
}
*/


#ifdef USE_I2C0
#error "The STM32 doesn't have I2C0, use I2C1 or I2C2"
#endif

#ifdef USE_I2C1

/** default I2C1 clock speed */
#ifndef I2C1_CLOCK_SPEED
#define I2C1_CLOCK_SPEED 200000
#endif
PRINT_CONFIG_VAR(I2C1_CLOCK_SPEED)

struct i2c_errors i2c1_errors;
volatile uint32_t i2c1_watchdog_counter;

void i2c1_hw_init(void) {

  i2c1.reg_addr = (void *)I2C1;
  i2c1.init_struct = NULL;
  i2c1.errors = &i2c1_errors;
  i2c1_watchdog_counter = 0;

  /* zeros error counter */
  ZEROS_ERR_COUNTER(i2c1_errors);

  // Extra
#ifdef I2C_DEBUG_LED
  LED_INIT();
#else

  /* reset peripheral to default state ( sometimes not achieved on reset :(  ) */
  //i2c_reset(I2C1);

  /* Configure priority grouping 0 bits for pre-emption priority and 4 bits for sub-priority. */
  scb_set_priority_grouping(SCB_AIRCR_PRIGROUP_NOGROUP_SUB16);

  /* Configure and enable I2C1 event interrupt --------------------------------*/
  nvic_set_priority(NVIC_I2C1_EV_EXTI23_IRQ, 0);
  nvic_enable_irq(NVIC_I2C1_EV_EXTI23_IRQ);

  /* Configure and enable I2C1 err interrupt ----------------------------------*/
  nvic_set_priority(NVIC_I2C1_ER_IRQ, 1);
  nvic_enable_irq(NVIC_I2C1_ER_IRQ);

  /* Enable peripheral clocks -------------------------------------------------*/
  /* Enable I2C1 clock */
  rcc_peripheral_enable_clock(&RCC_APB1ENR, RCC_APB1ENR_I2C1EN);
  /* Enable GPIO clock */
  gpio_enable_clock(I2C1_GPIO_PORT);
#if defined(STM32F1)
  gpio_set_mode(I2C1_GPIO_PORT, GPIO_MODE_OUTPUT_2_MHZ,
                GPIO_CNF_OUTPUT_ALTFN_OPENDRAIN,
                I2C1_GPIO_SCL | I2C1_GPIO_SDA);
#elif defined(STM32F4) || defined(STM32F3)
  gpio_mode_setup(I2C1_GPIO_PORT, GPIO_MODE_AF, GPIO_PUPD_NONE,
                  I2C1_GPIO_SCL | I2C1_GPIO_SDA);
#if !defined(STM32F3)
  gpio_set_output_options(I2C1_GPIO_PORT, GPIO_OTYPE_OD, GPIO_OSPEED_25MHZ,
                          I2C1_GPIO_SCL | I2C1_GPIO_SDA); //check stm32f3
#else
  gpio_set_output_options(I2C1_GPIO_PORT, GPIO_OTYPE_OD, GPIO_OSPEED_2MHZ,
                          I2C1_GPIO_SCL | I2C1_GPIO_SDA);  //check stm32f3
#endif
  gpio_set_af(I2C1_GPIO_PORT, GPIO_AF4, I2C1_GPIO_SCL | I2C1_GPIO_SDA);
#endif

#if defined(STM32F3)
  rcc_set_i2c_clock_hsi(I2C1);
#endif

  i2c_reset(I2C1);

#if defined(STM32F3)
  i2c_enable_analog_filter(I2C1);
  i2c_set_digital_filter(I2C1, I2C_CR1_DNF_DISABLED);
  //Configure PRESC[3:0] SDADEL[3:0] SCLDEL[3:0]  SCLH[7:0] SCLL[7:0] in TIMINGR
  i2c_100khz_i2cclk8mhz(I2C1);
  //configure No-Stretch CR1 (only relevant in slave mode)
  i2c_enable_stretching(I2C1);
  //addressing mode
  i2c_set_7bit_addr_mode(I2C1);
#endif

  // enable peripheral
  i2c_peripheral_enable(I2C1);

  /*
   * XXX: there is a function to do that already in libopencm3 but I am not
   * sure if it is correct, using direct register instead (esden)
   */
  //i2c_set_own_7bit_slave_address(I2C1, 0);
#if !defined(STM32F3)
  I2C_OAR1(I2C1) = 0 | 0x4000;
#endif

#if !defined(STM32F3)
  // enable error interrupts
  I2C_CR2(I2C1) |= I2C_CR2_ITERREN;
#else
  // enable error interrupts
  I2C_CR1(I2C1) |= I2C_CR1_ERRIE;
#endif

  i2c_setbitrate(&i2c1, I2C1_CLOCK_SPEED);
#endif
}


#if !defined(STM32F3)
void i2c1_ev_isr(void) {
#else
void i2c1_ev_exti23_isr(void) {
#endif
  uint32_t i2c = (uint32_t) i2c1.reg_addr;
#if !defined(STM32F3)
  I2C_CR2(i2c) &= ~I2C_CR2_ITERREN;
#else
  I2C_CR1(i2c) &= ~I2C_CR1_ERRIE;
#endif
  i2c_irq(&i2c1);
  i2c1_watchdog_counter = 0;
#if !defined(STM32F3)
  I2C_CR2(i2c) |= I2C_CR2_ITERREN;
#else
  I2C_CR1(i2c) |= I2C_CR1_ERRIE;
#endif
}

void i2c1_er_isr(void) {
  uint32_t i2c = (uint32_t) i2c1.reg_addr;
#if !defined(STM32F3)
  I2C_CR2(i2c) &= ~I2C_CR2_ITEVTEN;
#else
  I2C_CR1(i2c) &= ~I2C_CR1_TXIE;
  I2C_CR1(i2c) &= ~I2C_CR1_RXIE;
  //I2C_CR1(i2c) &= ~I2C_CR1_TCIE;
  //I2C_CR1(i2c) &= ~I2C_CR1_NACKIE; //check!!! seems fine
#endif
  i2c_irq(&i2c1);
  i2c1_watchdog_counter = 0;
#if !defined(STM32F3)
  I2C_CR2(i2c) |= I2C_CR2_ITEVTEN;
#else
  I2C_CR1(i2c) |= I2C_CR1_TXIE;
  I2C_CR1(i2c) |= I2C_CR1_RXIE;
  //I2C_CR1(i2c) |= I2C_CR1_TCIE;
  //I2C_CR1(i2c) |= I2C_CR1_NACKIE; //check!!! seems fine
#endif
}

#endif /* USE_I2C1 */

#ifdef USE_I2C2

