paparazzi/paparazzi/sw/airborne/arch/stm32/mcu_periph/i2c_arch.c
/** default I2C2 clock speed */
#ifndef I2C2_CLOCK_SPEED
#define I2C2_CLOCK_SPEED 300000
#endif
PRINT_CONFIG_VAR(I2C2_CLOCK_SPEED)

struct i2c_errors i2c2_errors;
volatile uint32_t i2c2_watchdog_counter;

void i2c2_hw_init(void) {

  i2c2.reg_addr = (void *)I2C2;
  i2c2.init_struct = NULL;
  i2c2.errors = &i2c2_errors;
  i2c2_watchdog_counter = 0;

  /* zeros error counter */
  ZEROS_ERR_COUNTER(i2c2_errors);

  /* reset peripheral to default state ( sometimes not achieved on reset :(  ) */
  //i2c_reset(I2C2);

  /* Configure priority grouping 0 bits for pre-emption priority and 4 bits for sub-priority. */
  scb_set_priority_grouping(SCB_AIRCR_PRIGROUP_NOGROUP_SUB16);

  /* Configure and enable I2C2 event interrupt --------------------------------*/
  nvic_set_priority(NVIC_I2C2_EV_EXTI24_IRQ, 0);
  nvic_enable_irq(NVIC_I2C2_EV_EXTI24_IRQ);

  /* Configure and enable I2C2 err interrupt ----------------------------------*/
  nvic_set_priority(NVIC_I2C2_ER_IRQ, 1);
  nvic_enable_irq(NVIC_I2C2_ER_IRQ);

  /* Enable peripheral clocks -------------------------------------------------*/
  /* Enable I2C2 clock */
  rcc_peripheral_enable_clock(&RCC_APB1ENR, RCC_APB1ENR_I2C2EN);
  /* Enable GPIO clock */
  gpio_enable_clock(I2C2_GPIO_PORT);
#if defined(STM32F1)
  gpio_set_mode(I2C2_GPIO_PORT, GPIO_MODE_OUTPUT_2_MHZ,
                GPIO_CNF_OUTPUT_ALTFN_OPENDRAIN,
                I2C2_GPIO_SCL | I2C2_GPIO_SDA);
#elif defined(STM32F4) || defined(STM32F3)
  gpio_mode_setup(I2C2_GPIO_PORT, GPIO_MODE_AF, GPIO_PUPD_NONE,
                  I2C2_GPIO_SCL | I2C2_GPIO_SDA);
#if !defined(STM32F3)
  gpio_set_output_options(I2C2_GPIO_PORT, GPIO_OTYPE_OD, GPIO_OSPEED_25MHZ,
                          I2C2_GPIO_SCL | I2C2_GPIO_SDA);  //check stm32f3
#else
  gpio_set_output_options(I2C2_GPIO_PORT, GPIO_OTYPE_OD, GPIO_OSPEED_2MHZ,
                          I2C2_GPIO_SCL | I2C2_GPIO_SDA);  //check stm32f3
#endif
  gpio_set_af(I2C2_GPIO_PORT, GPIO_AF4,
              I2C2_GPIO_SCL | I2C2_GPIO_SDA);
#endif

#if defined(STM32F3)
  rcc_set_i2c_clock_hsi(I2C2);
#endif

  i2c_reset(I2C2);

#if defined(STM32F3)
  i2c_enable_analog_filter(I2C2);
  i2c_set_digital_filter(I2C2, I2C_CR1_DNF_DISABLED);
  //Configure PRESC[3:0] SDADEL[3:0] SCLDEL[3:0]  SCLH[7:0] SCLL[7:0] in TIMINGR
  i2c_100khz_i2cclk8mhz(I2C2);
  //configure No-Stretch CR1 (only relevant in slave mode)
  i2c_enable_stretching(I2C2);
  //addressing mode
  i2c_set_7bit_addr_mode(I2C2);
#endif

  // enable peripheral
  i2c_peripheral_enable(I2C2);

  /*
   * XXX: there is a function to do that already in libopencm3 but I am not
   * sure if it is correct, using direct register instead (esden)
   */
  //i2c_set_own_7bit_slave_address(I2C2, 0);
#if !defined(STM32F3)
  I2C_OAR1(I2C2) = 0 | 0x4000;
#endif

#if !defined(STM32F3)
  // enable error interrupts
  I2C_CR2(I2C2) |= I2C_CR2_ITERREN;
#else
  // enable error interrupts
  I2C_CR1(I2C2) |= I2C_CR1_ERRIE;
#endif

  i2c_setbitrate(&i2c2, I2C2_CLOCK_SPEED);
}

#if !defined(STM32F3)
void i2c1_ev_isr(void) {
#else
void i2c1_ev_exti23_isr(void) {
#endif
  uint32_t i2c = (uint32_t) i2c2.reg_addr;
#if !defined(STM32F3)
  I2C_CR2(i2c) &= ~I2C_CR2_ITERREN;
#else
  I2C_CR1(i2c) &= ~I2C_CR1_ERRIE;
#endif
  i2c_irq(&i2c2);
  i2c2_watchdog_counter = 0;
#if !defined(STM32F3)
  I2C_CR2(i2c) |= I2C_CR2_ITERREN;
#else
  I2C_CR1(i2c) |= I2C_CR1_ERRIE;
#endif
}

void i2c2_er_isr(void) {
  uint32_t i2c = (uint32_t) i2c2.reg_addr;
#if !defined(STM32F3)
  I2C_CR2(i2c) &= ~I2C_CR2_ITEVTEN;
#else
  I2C_CR1(i2c) &= ~I2C_CR1_TXIE;
  I2C_CR1(i2c) &= ~I2C_CR1_RXIE;
  //I2C_CR1(i2c) &= ~I2C_CR1_TCIE;
  //I2C_CR1(i2c) &= ~I2C_CR1_NACKIE; //check!!! seems fine
#endif
  i2c_irq(&i2c2);
  i2c2_watchdog_counter = 0;
#if !defined(STM32F3)
  I2C_CR2(i2c) |= I2C_CR2_ITEVTEN;
#else
  I2C_CR1(i2c) |= I2C_CR1_TXIE;
  I2C_CR1(i2c) |= I2C_CR1_RXIE;
  //I2C_CR1(i2c) |= I2C_CR1_TCIE;
  //I2C_CR1(i2c) |= I2C_CR1_NACKIE; //check!!! seems fine
#endif
}

#endif /* USE_I2C2 */


#if defined USE_I2C3 && defined STM32F4

/** default I2C3 clock speed */
#ifndef I2C3_CLOCK_SPEED
#define I2C3_CLOCK_SPEED 300000
#endif
PRINT_CONFIG_VAR(I2C3_CLOCK_SPEED)

struct i2c_errors i2c3_errors;
volatile uint32_t i2c3_watchdog_counter;

void i2c3_hw_init(void) {

  i2c3.reg_addr = (void *)I2C3;
  i2c3.init_struct = NULL;
  i2c3.errors = &i2c3_errors;
  i2c3_watchdog_counter = 0;

  /* zeros error counter */
  ZEROS_ERR_COUNTER(i2c3_errors);

  /* reset peripheral to default state ( sometimes not achieved on reset :(  ) */
  //i2c_reset(I2C3);

  /* Configure priority grouping 0 bits for pre-emption priority and 4 bits for sub-priority. */
  scb_set_priority_grouping(SCB_AIRCR_PRIGROUP_NOGROUP_SUB16);

  /* Configure and enable I2C3 event interrupt --------------------------------*/
  nvic_set_priority(NVIC_I2C3_EV_IRQ, 0);
  nvic_enable_irq(NVIC_I2C3_EV_IRQ);

  /* Configure and enable I2C3 err interrupt ----------------------------------*/
  nvic_set_priority(NVIC_I2C3_ER_IRQ, 1);
  nvic_enable_irq(NVIC_I2C3_ER_IRQ);

  /* Enable peripheral clocks -------------------------------------------------*/
  /* Enable I2C3 clock */
  rcc_peripheral_enable_clock(&RCC_APB1ENR, RCC_APB1ENR_I2C3EN);
  /* Enable GPIO clock */
  gpio_enable_clock(I2C3_GPIO_PORT_SCL);
  gpio_mode_setup(I2C3_GPIO_PORT_SCL, GPIO_MODE_AF, GPIO_PUPD_NONE, I2C3_GPIO_SCL);
  gpio_set_output_options(I2C3_GPIO_PORT_SCL, GPIO_OTYPE_OD, GPIO_OSPEED_25MHZ,
                          I2C3_GPIO_SCL);
  gpio_set_af(I2C3_GPIO_PORT_SCL, GPIO_AF4, I2C3_GPIO_SCL);

  gpio_enable_clock(I2C3_GPIO_PORT_SDA);
  gpio_mode_setup(I2C3_GPIO_PORT_SDA, GPIO_MODE_AF, GPIO_PUPD_NONE, I2C3_GPIO_SDA);
  gpio_set_output_options(I2C3_GPIO_PORT_SDA, GPIO_OTYPE_OD, GPIO_OSPEED_25MHZ,
                          I2C3_GPIO_SDA);
  gpio_set_af(I2C3_GPIO_PORT_SDA, GPIO_AF4, I2C3_GPIO_SDA);

  i2c_reset(I2C3);

  // enable peripheral
  i2c_peripheral_enable(I2C3);

  /*
   * XXX: there is a function to do that already in libopencm3 but I am not
   * sure if it is correct, using direct register instead (esden)
   */
  //i2c_set_own_7bit_slave_address(I2C3, 0);
  I2C_OAR1(I2C3) = 0 | 0x4000;

  // enable error interrupts
  I2C_CR2(I2C1) |= I2C_CR2_ITERREN;

