paparazzi/paparazzi/sw/airborne/arch/stm32/mcu_periph/i2c_arch.c
  i2c_setbitrate(&i2c3, I2C3_CLOCK_SPEED);
}

void i2c3_ev_isr(void) {
  uint32_t i2c = (uint32_t) i2c3.reg_addr;
  I2C_CR2(i2c) &= ~I2C_CR2_ITERREN;
  i2c_irq(&i2c3);
  i2c3_watchdog_counter = 0;
  I2C_CR2(i2c) |= I2C_CR2_ITERREN;
}

void i2c3_er_isr(void) {
  uint32_t i2c = (uint32_t) i2c3.reg_addr;
  I2C_CR2(i2c) &= ~I2C_CR2_ITEVTEN;
  i2c_irq(&i2c3);
  i2c3_watchdog_counter = 0;
  I2C_CR2(i2c) |= I2C_CR2_ITEVTEN;
}

#endif /* USE_I2C3 */

//////////////////////////////////////////////////
// Set Bitrate to Match your application:
// -short wires, low capacitance bus: IMU: high speed
// -long wires with a lot of capacitance: motor controller: put speed as low as possible

void i2c_setbitrate(struct i2c_periph *periph, int bitrate)
{
  // If NOT Busy
  if (i2c_idle(periph))
  {
    volatile int devider;
    volatile int risetime;

    uint32_t i2c = (uint32_t) periph->reg_addr;

    /*****************************************************
    Bitrate:

    -CR2 + CCR + TRISE registers
    -only change when PE=0

    e.g.

    10kHz:  36MHz + Standard 0x708 + 0x25
    70kHz:  36MHz + Standard 0x101 +
    400kHz: 36MHz + Fast 0x1E      + 0xb

    // 1) Program peripheral input clock CR2: to get correct timings
    // 2) Configure clock control registers
    // 3) Configure rise time register
    ******************************************************/
#if !defined(STM32F3)
    if (bitrate < 3000)
      bitrate = 3000;

    // 36MHz, fast scl: 2counts low 1 count high -> / 3:
    devider = 18000 / (bitrate/1000);

    // never allow faster than 600kbps
    if (devider < 20)
      devider = 20;

    // no overflow either
    if (devider >=4095)
      devider = 4095;

    // risetime can be up to 1/6th of the period
    risetime = 1000000 / (bitrate/1000) / 6 / 28;

    if (risetime < 10)
      risetime = 10;

    // more will overflow the register: for more you should lower the FREQ
    if (risetime >=31)
      risetime = 31;

    // we do not expect an interrupt as the interface should have been idle, but just in case...
    __disable_irq(); // this code is in user space:

    // CCR can only be written when PE is disabled
    // p731 note 5
    I2C_CR1(i2c) &= ~ I2C_CR1_PE;

    // 1)
    I2C_CR2(i2c) = 0x0324;
    // 2)
    //I2C_CCR(i2c) = 0x8000 + devider;
    I2C_CCR(i2c) = 0x0000 + devider;
    // 3)
    I2C_TRISE(i2c) = risetime;

    // Re-Enable
    I2C_CR1(i2c) |=   I2C_CR1_PE;

    __enable_irq();
#else
    // we do not expect an interrupt as the interface should have been idle, but just in case...
    __disable_irq(); // this code is in user space:

    // CCR can only be written when PE is disabled
    // p731 note 5
    I2C_CR1(i2c) &= ~ I2C_CR1_PE;

    i2c_100khz_i2cclk8mhz(i2c);

    // Re-Enable
    I2C_CR1(i2c) |=   I2C_CR1_PE;

    __enable_irq();
#endif


#ifdef I2C_DEBUG_LED
    __disable_irq(); // this code is in user space:

    LED2_ON();
    LED1_ON();
    LED2_OFF();
    LED1_OFF();
    LED2_ON();
    LED1_ON();
    LED2_OFF();
    LED1_OFF();

    __enable_irq();
#endif

  }
}


/// @todo Watchdog timer
void i2c_event(void)
{
#ifdef USE_I2C1
  i2c1_watchdog_counter++;
#endif

#ifdef USE_I2C2
  i2c2_watchdog_counter++;

  if (i2c2_watchdog_counter > 10000)
  {
    i2c2.errors->timeout_tlow_cnt++;
    i2c2_watchdog_counter = 0;
  }


#ifdef I2C_DEBUG_LED
  if (i2c2_watchdog_counter == 0)
  {
    __disable_irq();

    LED2_ON();
    LED1_ON();
    LED1_OFF();
    LED1_ON();
    LED1_OFF();
    LED1_ON();
    LED1_OFF();
    LED1_ON();
    LED1_OFF();
    if (i2c2.status == I2CIdle)
    {
      LED1_ON();
      LED1_OFF();
    }
    else if (i2c2.status == I2CStartRequested)
    {
      LED1_ON();
      LED1_OFF();
      LED1_ON();
      LED1_OFF();

    }
    LED2_OFF();

    //regs = (I2C_TypeDef *) i2c2.reg_addr;
    //LED_SHOW_ACTIVE_BITS(regs);

    __enable_irq();
  }
#endif


  //if (i2c2.status == I2CIdle)
  {
    //if (i2c_idle(&i2c2))
    {
      //__disable_irq();
      // More work to do
      //if (i2c2.trans_extract_idx != i2c2.trans_insert_idx)
      {
        // Restart transaction doing the Rx part now
        //PPRZ_I2C_SEND_START(&i2c2);
      }
      //__enable_irq();
    }
  }
#endif

#ifdef USE_I2C3
  i2c3_watchdog_counter++;
#endif
}

/////////////////////////////////////////////////////////
// Implement Interface Functions

bool_t i2c_submit(struct i2c_periph* periph, struct i2c_transaction* t) {

  uint8_t temp;
  temp = periph->trans_insert_idx + 1;
  if (temp >= I2C_TRANSACTION_QUEUE_LEN) temp = 0;
  if (temp == periph->trans_extract_idx) {
    // queue full
    periph->errors->queue_full_cnt++;
    t->status = I2CTransFailed;
    return FALSE;
  }

  t->status = I2CTransPending;

  __disable_irq();
  /* put transacation in queue */
  periph->trans[periph->trans_insert_idx] = t;
  periph->trans_insert_idx = temp;

  /* if peripheral is idle, start the transaction */
  // if (PPRZ_I2C_IS_IDLE(p))
  if (periph->status == I2CIdle)
  {
    //if (i2c_idle(periph))
    {
#ifdef I2C_DEBUG_LED
#ifdef USE_I2C1
      if (periph == &i2c1)
      {

      }
      else
#endif
#endif
      {
#ifdef I2C_DEBUG_LED
        LED2_ON();
        LED2_OFF();
#endif
        PPRZ_I2C_SEND_START(periph);
      }
    }
  }
  /* else it will be started by the interrupt handler when the previous transactions completes */
  __enable_irq();

  return TRUE;
}

bool_t i2c_idle(struct i2c_periph* periph)
{
  // This is actually a difficult function:
  // -simply reading the status flags can clear bits and corrupt the transaction

  uint32_t i2c = (uint32_t) periph->reg_addr;

#ifdef I2C_DEBUG_LED
#ifdef USE_I2C1
  if (periph == &i2c1)
  {
    return TRUE;
  }
#endif
#endif

  // First we check if the software thinks it is ready
  if (periph->status == I2CIdle)
#if !defined(STM32F3)
    return ! (BIT_X_IS_SET_IN_REG( I2C_SR2_BUSY, I2C_SR2(i2c) ) );
#else
    return ! (BIT_X_IS_SET_IN_REG( I2C_ISR_BUSY, I2C_ISR(i2c) ) );
#endif
  else
    return FALSE;
}

